system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




innerCylinderSmall.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}

contra.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}


outerCylinder.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}


propellerStem1.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}


propellerStem2.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}


propellerStem3.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}


propellerTip.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}

propellerTip1.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}


// ************************************************************************* //
